{"keras_version": "2.1.1", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["activation_30", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 6, 16, 8]}}, {"name": "input_2", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_2", "sparse": false, "batch_input_shape": [null, 8, 16, 8]}}, {"name": "input_3", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_3", "sparse": false, "batch_input_shape": [null, 8, 16, 8]}}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_1", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_11", "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_11", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_21", "inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_21", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "activation_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"name": "activation_10", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"name": "activation_19", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_19", "activation": "relu", "trainable": true}}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_2", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_12", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_12", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_22", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_22", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "activation_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"name": "activation_11", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": true}}, {"name": "activation_20", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_20", "activation": "relu", "trainable": true}}, {"name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_3", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_13", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_13", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_23", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_23", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "merge_1", "inbound_nodes": [[["conv2d_1", 0, 0, {"mask": [null, null]}], ["conv2d_3", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"name": "merge_1", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "merge_5", "inbound_nodes": [[["conv2d_11", 0, 0, {"mask": [null, null]}], ["conv2d_13", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"name": "merge_5", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "merge_9", "inbound_nodes": [[["conv2d_21", 0, 0, {"mask": [null, null]}], ["conv2d_23", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"name": "merge_9", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "activation_3", "inbound_nodes": [[["merge_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"name": "activation_12", "inbound_nodes": [[["merge_5", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_12", "activation": "relu", "trainable": true}}, {"name": "activation_21", "inbound_nodes": [[["merge_9", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_21", "activation": "relu", "trainable": true}}, {"name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_4", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_14", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_14", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_24", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_24", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "activation_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"name": "activation_13", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_13", "activation": "relu", "trainable": true}}, {"name": "activation_22", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_22", "activation": "relu", "trainable": true}}, {"name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_5", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_15", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_15", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_25", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_25", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "merge_2", "inbound_nodes": [[["merge_1", 0, 0, {"mask": [null, null]}], ["conv2d_5", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"name": "merge_2", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "merge_6", "inbound_nodes": [[["merge_5", 0, 0, {"mask": [null, null]}], ["conv2d_15", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"name": "merge_6", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "merge_10", "inbound_nodes": [[["merge_9", 0, 0, {"mask": [null, null]}], ["conv2d_25", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"name": "merge_10", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "activation_5", "inbound_nodes": [[["merge_2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"name": "activation_14", "inbound_nodes": [[["merge_6", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_14", "activation": "relu", "trainable": true}}, {"name": "activation_23", "inbound_nodes": [[["merge_10", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_23", "activation": "relu", "trainable": true}}, {"name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_6", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_16", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_16", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_26", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_26", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "activation_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"name": "activation_15", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_15", "activation": "relu", "trainable": true}}, {"name": "activation_24", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_24", "activation": "relu", "trainable": true}}, {"name": "conv2d_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_7", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_17", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_17", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_27", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_27", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "merge_3", "inbound_nodes": [[["merge_2", 0, 0, {"mask": [null, null]}], ["conv2d_7", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"name": "merge_3", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "merge_7", "inbound_nodes": [[["merge_6", 0, 0, {"mask": [null, null]}], ["conv2d_17", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"name": "merge_7", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "merge_11", "inbound_nodes": [[["merge_10", 0, 0, {"mask": [null, null]}], ["conv2d_27", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"name": "merge_11", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "activation_7", "inbound_nodes": [[["merge_3", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"name": "activation_16", "inbound_nodes": [[["merge_7", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_16", "activation": "relu", "trainable": true}}, {"name": "activation_25", "inbound_nodes": [[["merge_11", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_25", "activation": "relu", "trainable": true}}, {"name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_8", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_18", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_18", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_28", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_28", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "activation_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"name": "activation_17", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_17", "activation": "relu", "trainable": true}}, {"name": "activation_26", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_26", "activation": "relu", "trainable": true}}, {"name": "conv2d_9", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_9", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_19", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_19", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_29", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_29", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "input_4", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_4", "sparse": false, "batch_input_shape": [null, 8]}}, {"name": "merge_4", "inbound_nodes": [[["merge_3", 0, 0, {"mask": [null, null]}], ["conv2d_9", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"name": "merge_4", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "merge_8", "inbound_nodes": [[["merge_7", 0, 0, {"mask": [null, null]}], ["conv2d_19", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"name": "merge_8", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "merge_12", "inbound_nodes": [[["merge_11", 0, 0, {"mask": [null, null]}], ["conv2d_29", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"name": "merge_12", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "dense_1", "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 10, "use_bias": true, "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"name": "activation_9", "inbound_nodes": [[["merge_4", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"name": "activation_18", "inbound_nodes": [[["merge_8", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_18", "activation": "relu", "trainable": true}}, {"name": "activation_27", "inbound_nodes": [[["merge_12", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_27", "activation": "relu", "trainable": true}}, {"name": "activation_28", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_28", "activation": "relu", "trainable": true}}, {"name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_10", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 2, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_20", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_20", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 2, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "conv2d_30", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_30", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 2, "kernel_size": [3, 3], "data_format": "channels_first"}}, {"name": "dense_2", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 256, "use_bias": true, "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"name": "i_layer_1", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "iLayer", "config": {"name": "i_layer_1", "trainable": true}}, {"name": "i_layer_2", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "iLayer", "config": {"name": "i_layer_2", "trainable": true}}, {"name": "i_layer_3", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "class_name": "iLayer", "config": {"name": "i_layer_3", "trainable": true}}, {"name": "activation_29", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_29", "activation": "relu", "trainable": true}}, {"name": "merge_13", "inbound_nodes": [[["i_layer_1", 0, 0, {"mask": [null, null, null]}], ["i_layer_2", 0, 0, {"mask": [null, null, null]}], ["i_layer_3", 0, 0, {"mask": [null, null, null]}]]], "class_name": "Merge", "config": {"name": "merge_13", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "reshape_1", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [2, 16, 8]}}, {"name": "merge_14", "inbound_nodes": [[["merge_13", 0, 0, {"mask": [null, null]}], ["reshape_1", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"name": "merge_14", "mode": "sum", "output_shape": null, "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null}}, {"name": "activation_30", "inbound_nodes": [[["merge_14", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_30", "activation": "tanh", "trainable": true}}]}, "backend": "tensorflow"}